<!DOCTYPE html>
<html>
<head>
	<base target="menuFrame">
	<meta http-equiv="content-type" content="text/html; charset=utf-8">
	<meta name="author" content="Vitaly V. Sazonov">
	<link rel="shortcut icon" href="../favicon.ico" type="image/x-icon">
	<link rel="stylesheet" type="text/css" href="../main.css">
	<script type="text/javascript" src="../main.js"></script>
</head>

<body onload="showVariantForm();">
	<noscript><div><h6>Отключен JavaScript!</h6>Для корректного отображения страницы <a href="../../enableJS.html" target="_blank">включите JavaScript</a></div></noscript>
<!-- Ссылка на теорию задаётся в атрибуте "link" в теге с id="hint".
     Если теории нет, то оставить без изменения -->

	<div id="hint" link="../files/polnSprPoC/02/02.htm">
		<div>
<!-- Номер семестра и работы -->

			Первый семестр. Лабораторная работа № 6

<!-- /Номер семестра и работы -->
		</div>
		<span></span>
	</div>
	<div id="variantForm"></div>
	<div id="contentTask">
<!-- Текст -->

		<h1>Линейные программы</h1>
		<p>Оформить отчет о лабораторной работе, в котором должны быть отражены название ЛР, цели работы, задание на ЛР, порядок выполнения, выводы по работе.</p>
		<p>Поместить файлы с исходным кодом программ на <code>С</code> по адресу <code>/home/username/lab</code>{номер лаб.}<code>/1.c</code>, <code>/home/username/lab</code>{номер лаб.}<code>/2.c</code> и т. д., где номер в имени файла должен соответствовать номеру задания; <code>username</code> – это имя пользователя.</p>
		<p>В начале каждого файла должны быть комментарии, в которых описано предназначение данной программы.</p>
		<p>Отчет представлять при защите ЛР.</p>
		<h5>Задания</h5>
		<ol>
			<li>Составить программу на <code>С</code>, которая печатает фамилию и имя студента.</li>
			<li>Составить программу на <code>С</code>, которая печатает дату, месяц и год рождения студента, используя спецификаторы формата в функции <code>printf()</code> для вывода целочисленных переменных.</li>
			<li>Модифицировать программу из задания 2, так чтобы день, месяц и год рождения вводился с клавиатуры.</li>
			<li>
				Вывести отформатированный текст
				<pre class="padLeft30"><span class="variants"><span>"ABC"/\
       50%
CBA</span><span>"News"^
50%
   /CBA\</span><span>x,y,z   %50%
/A\     "Z"</span><span>%"Time"% 34
\\B//    ?</span><span>News     34%
"\B/"    &</span><span>#Time#   83
\"Date"/ 10%</span><span>15/60*100%=
           25%
"H"\</span><span>тип "int" 25
\\B//     %%</span><span>"%"      \/\
83       "$"</span><span>"C:\Windows\
            system.ini"
/30%</span><span>"\"      "/"
#22      45%</span><span>\&/      \%/
"abs"    45</span><span>printf("text\n");
3/2=
    50%</span><span>*/*      "\"
56%      25</span><span>*\*      *%*
20/5=    5
"r"</span><span>scanf("%d%d",&a,&b);
(\)
   70</span></span></pre>
				Вывести на экран символы, коды которых равны
				<ul>
					<li>
						<span class="variants">
							<span>146, 107</span><span>43, 145</span><span>113, 56</span><span>70, 165</span><span>135, 103</span><span>124, 167</span><span>141, 103</span><span>141, 132</span><span>115, 147</span><span>173, 42</span><span>116, 62</span><span>146, 41</span><span>130, 145</span><span>117, 40</span><span>124, 134</span><span>130, 160</span>
						</span>
						в восьмеричной системе
					</li>
					<li>
						<span class="variants">
							<span>47, 84</span><span>50, 44</span><span>64, 94</span><span>119, 87</span><span>43, 119</span><span>90, 103</span><span>65, 61</span><span>123, 115</span><span>96, 90</span><span>93, 124</span><span>90, 42</span><span>52, 73</span><span>104, 32</span><span>58, 98</span><span>39, 117</span><span>69, 99</span>
						</span>
						в десятичной системе
					</li>
					<li>
						<span class="variants">
							<span>75, 27</span><span>62, 41</span><span>44, 3a</span><span>5f, 71</span><span>20, 61</span><span>74, 41</span><span>47, 43</span><span>76, 43</span><span>64, 2c</span><span>7d, 64</span><span>39, 22</span><span>7d, 32</span><span>76, 74</span><span>54, 55</span><span>6c, 41</span><span>68, 37</span>
						</span>
						в шестнадцатеричной системе
					</li>
				</ul>
			</li>
		</ol>
		<p><a href="1.html">Основные определения</a></p>

<!-- /Текст -->
	</div>
</body>
</html>
